export type EquipmentType = {
    category: string;
    items: {
        name: string;
        price: string;
        note: string;
        damage?: string;
        capacity?: string;
    }[];
};

export const EQUIPMENT_LIST: EquipmentType[] = [
    {
        category: "探险装备",
        items: [
            { name: "发条式闹钟", price: "$1至$5", note: "定时炸弹的理想计时器！" },
            { name: "50发子弹", price: "$0.30", note: "霰弹枪子弹每25发约70美分" },
            { name: "自行车", price: "$24至$45", note: "最高速度20英里/时（32公里/时）；越野" },
            { name: "8倍望远镜", price: "$25", note: "5倍望远镜12美元" },
            { name: "照相机", price: "$5至$40", note: "一卷黑白底片（8张）需20美分" },
            { name: "8毫米摄影机", price: "$30至$50", note: "一轮黑白底片（8分钟）需4美元" },
            { name: "1英尺（约30.5厘米）铁链", price: "$0.50", note: "挂锁需1美元" },
            { name: "一包香烟", price: "$0.15", note: "一盒雪茄2美元" },
            { name: "双节电池手电筒", price: "$1", note: "一节电池5美分" },
            { name: "防毒面具", price: "$5", note: "" },
            { name: "盖革计数器", price: "$10", note: "" },
            { name: "便携式发电机", price: "$120至$300", note: "" },
            { name: "黄金，1金衡盎司（约31克）", price: "$35", note: "珠宝成品与稀有金币的价格更加昂贵" },
            { name: "吉他", price: "$9", note: "" },
            { name: "煤油灯", price: "$4", note: "" },
            { name: "医疗用品包与急救箱", price: "$20", note: "" },
            { name: "木匠/锁匠专用工具", price: "$10", note: "" },
            { name: "捕兽夹", price: "$6", note: "使用警觉来躲避，使用藏匿来布设；伤害值+1，并使被夹住的肢体无法动弹" },
            { name: "打字机", price: "$20至$45", note: "便携式打字机需50至70美元" },
            { name: "焊接吹管与燃料罐", price: "$95", note: "一罐乙炔8美元" },
            { name: "Zippo打火机（1932）", price: "$1", note: "" }
        ]
    },
    {
        category: "衣物与服饰",
        items: [
            { name: "皮靴，一双", price: "$3至$10", note: "" },
            { name: "女式服装，一套", price: "$3至$12+", note: "包括连衣裙、长筒袜、帽子" },
            { name: "男士服装，一套", price: "$13至$27+", note: "包括西服、衬衫、领带、袜子、帽子" },
            { name: "豹皮/貂皮大衣", price: "$90/$585", note: "" },
            { name: "风衣", price: "$11", note: "" },
            { name: "极地探险服装", price: "$60", note: "包括厚皮大衣、长靴、皮手套" },
            { name: "非洲草原探险服装", price: "$25", note: "包括皮夹克、卡其布衬衫与长裤、遮阳帽" },
            { name: "航海服装", price: "$15", note: "包括船员的厚呢短大衣或雨衣、水手帽、工作衣、毛衣、帆布长裤" },
            { name: "女鞋/男鞋", price: "$1+/$4+", note: "" },
            { name: "眼镜", price: "$9", note: "" },
            { name: "晚礼服", price: "$25", note: "也叫“晚宴正装”" },
            { name: "手表或怀表", price: "$2至$20+", note: "" }
        ]
    },
    {
        category: "通讯与交通",
        items: [
            { name: "机票，每英里价格", price: "$0.12", note: "时速90至150英里/时（约150至241公里/时）" },
            { name: "因超速行驶/非法携带枪支/非法闯入/走私而进行贿赂", price: "$5至$100+", note: "需配合使用警方交谈、安抚等能力。一名警员的工资约为每日3美元" },
            { name: "汽油，每加仑", price: "$5", note: "" },
            { name: "当地搬运工，每日工资", price: "$0.05至$0.25", note: "土著向导每日工资1美元" },
            { name: "邮轮船票", price: "$10至$100+", note: "天气良好时日行600英里" },
            { name: "卧铺列车车票，每英里", price: "$0.02至$0.07", note: "平均时速40英里/时（约63公里/时），或日行900英里（约1448公里），取决于停站次数" },
            { name: "电报，每个单词", price: "$0.05", note: "国际长途电报每个单词25美分" },
            { name: "轮胎，一组4个", price: "$4至$10", note: "" },
            { name: "日间班次的火车票，每英里", price: "$0.04", note: "平均时速35英里/时（约56公里/时），取决于停站次数" }
        ]
    },
    {
        category: "食物与住所",
        items: [
            { name: "公寓月租", price: "$12至$50+", note: "" },
            { name: "一条面包", price: "$0.05", note: "" },
            { name: "一瓶6.5盎司（约184毫升）可口可乐", price: "$0.05", note: "" },
            { name: "大学一年学费", price: "$200至$2,000", note: "哈佛大学一年的学费约为4500美元" },
            { name: "旅馆客房住宿费", price: "$0.25至$3", note: "在纽约的华尔道夫酒店住一晚需5至10美元" },
            { name: "三居室的房屋售价", price: "$2,800", note: "" },
            { name: "自助快餐厅的一餐", price: "$0.10至$0.25", note: "咖啡总是一个镍币（5美分）一杯" },
            { name: "家中一顿便餐", price: "$0.65", note: "3磅（约1.36千克）烤肉，外加土豆和洋葱" },
            { name: "正式餐馆的一餐", price: "$0.25至$1", note: "纽约彩虹餐厅的牛排晚餐需3美元，外加红酒1美元" },
            { name: "1夸脱（约1升）牛奶", price: "$0.1", note: "" },
            { name: "电影票及爆米花", price: "$0.2至$0.5", note: "包括电影开场前的新闻短片和卡通片" },
            { name: "威士忌，一杯/一瓶", price: "$0.35+/$4+", note: "劣酒的价格更便宜" }
        ]
    },
    {
        category: "武器：极重枪械 (伤害值+2)",
        items: [
            { name: "赫兰-赫兰“双管急速型”.600猎象步枪（1903）", price: "$500", capacity: "2", note: "下一回合，射击者必须通过难度为3的运动检定才能保持站立。这一动作将占据该回合的行动" },
            { name: "勃朗宁自动步枪（BAR）.303机枪（1918）", price: "$500", capacity: "20", note: "需使用双脚架，并以匍匐姿势射击" }
        ]
    },
    {
        category: "武器：重型枪械 (伤害值+1)",
        items: [
            { name: "威利12号口径信号枪（1882）", price: "$30", capacity: "1", note: "仅在近身（无伤害加值）或近距离内才会造成伤害；如击中远距离以内的易燃物，会使其燃烧" },
            { name: "柯尔特M1911A1式.45 ACP自动手枪（1926）", price: "$50", capacity: "7", note: "美国军用手枪；所有修理或解除卡壳的检定难度均-1" },
            { name: "鲁格P08式9毫米自动手枪（1908）", price: "$50", capacity: "8", note: "德国军用手枪" },
            { name: "沃尔特P38式9毫米自动手枪（1938）", price: "$75", capacity: "8", note: "德国军用手枪" },
            { name: "FN勃朗宁大火力9毫米半自动手枪（1935）", price: "$75", capacity: "13", note: "" },
            { name: "韦伯利1号MK4型.455 SAA左轮手枪（1915）", price: "$25", capacity: "6", note: "英国军用手枪" },
            { name: "史密斯-威森.38特种左轮手枪（1902）", price: "$30", capacity: "6", note: "美国警用手枪" },
            { name: "史密斯-威森27型.357马格南左轮手枪（1927）", price: "$80", capacity: "6", note: "" },
            { name: "汤普森M1921冲锋枪（1921）", price: "$200", capacity: "20, 30, 50 或100", note: "连发规则" },
            { name: "施迈瑟MP28冲锋枪（1928）", price: "$200", capacity: "32", note: "连发规则" },
            { name: "毛瑟98K式7.92毫米步枪（1935）", price: "$125", capacity: "5", note: "德国战斗步枪；该数据同样可用于苏联莫辛-纳甘M10式7.62毫米战斗步枪（价格为100美元）" },
            { name: "M1加兰德.30-06步枪（1936）", price: "$120", capacity: "8", note: "美国战斗步枪" },
            { name: "李-恩菲尔德3型.303步枪（1907）", price: "$100", capacity: "10", note: "英国战斗步枪" },
            { name: "温彻斯特M1912式12口径唧筒霰弹枪（1912）", price: "$50", capacity: "5", note: "" },
            { name: "雷明顿M32式12口径霰弹枪（1932）", price: "$35", capacity: "2", note: "双管" }
        ]
    },
    {
        category: "武器：轻型枪械 (伤害值+0)",
        items: [
            { name: "韦伯利-斯科特警用.32ACP自动手枪（1906）", price: "$10", capacity: "8", note: "" },
            { name: "TT-3托卡列夫7.62毫米自动手枪（1933）", price: "$45", capacity: "8", note: "苏联军用/警用手枪" },
            { name: "南部十四式8毫米自动手枪（1925）", price: "$40", capacity: "8", note: "日本军用手枪" },
            { name: "毛瑟“扫把柄”7.62毫米自动手枪（1896）*", price: "$50", capacity: "10", note: "" },
            { name: "雷明顿.41双管袖珍手枪（1866）", price: "$20", capacity: "2", note: "若要在携带者身上发现此枪，检定难度+1；射程仅为近身范围" },
            { name: "柯尔特警用.32左轮枪（1907）", price: "$15", capacity: "6", note: "美国警用手枪" },
            { name: "沃尔特PPK.32自动手枪（1931）", price: "$70", capacity: "7", note: "" },
            { name: "雷明顿M34式.22LR运动步枪（1932）", price: "$45", capacity: "20", note: "" },
            { name: "曼利夏-卡尔卡诺M1891式6.5毫米手动卡宾枪（1891）", price: "$20", capacity: "6", note: "意大利战斗步枪；该数据同样可用于日本的有坂四四式步骑枪" },
            { name: "温彻斯特M1912式20号口径唧筒散弹枪（1912）", price: "$50", capacity: "5", note: "" },
            { name: "雷明顿M32式20号口径散弹枪（1932）", price: "$35", capacity: "2", note: "双管" }
        ]
    },
    {
        category: "车辆",
        items: [
            { name: "1928年印第安101“斥候”摩托车", price: "$200", note: "速度（英里时速/公里时速）：75/121。在越野环境下，为驾驶检定提供+1的加成；越野" },
            { name: "1936年哈雷-戴维森61E“脊状头”摩托车", price: "$300", note: "速度（英里时速/公里时速）：120/193。越野" },
            { name: "1927年福特A型轿车", price: "$400", note: "速度（英里时速/公里时速）：75/121。双座；后部附带可折叠的敞篷座位" },
            { name: "1935年威利斯77型轿车", price: "$500", note: "速度（英里时速/公里时速）：75/121。" },
            { name: "1933年雪佛兰半吨轻型卡车", price: "$550", note: "速度（英里时速/公里时速）：60/97。越野" },
            { name: "1935年宝马R-12型摩托车", price: "$600", note: "速度（英里时速/公里时速）：70/113。越野" },
            { name: "1933年里奥“高速货车”1吨轻型货车", price: "$650", note: "速度（英里时速/公里时速）：80/129。每一个场景可恢复1点驾驶能力点数" },
            { name: "1935年冒险家“气流”轿跑车", price: "$700", note: "速度（英里时速/公里时速）：85/137。" },
            { name: "1937年福特半吨面包货车", price: "$700", note: "速度（英里时速/公里时速）：60/97。" },
            { name: "1932年道奇1吨卡车", price: "$750", note: "速度（英里时速/公里时速）：75/121。" },
            { name: "1935年帕卡德120型巡游车", price: "$1,100", note: "速度（英里时速/公里时速）：85/137。" },
            { name: "1936年林肯“飘逸”V12型轿车", price: "$1,250", note: "速度（英里时速/公里时速）：90/145。" },
            { name: "1934年克莱斯勒8型“气流”轿车", price: "$1,350", note: "速度（英里时速/公里时速）：85/137。" },
            { name: "1930年福特2吨半卡车", price: "$1,600", note: "速度（英里时速/公里时速）：55/89。越野" },
            { name: "1935年奥本851型轿跑车", price: "$2,000", note: "速度（英里时速/公里时速）：100/161。" },
            { name: "1937年司徒贝克“总统”8型轿车", price: "$2,500", note: "速度（英里时速/公里时速）：75/121。" },
            { name: "1931年斯图兹“熊猫”敞篷车", price: "$3,500", note: "速度（英里时速/公里时速）：70/123。双座；在道路行驶的情况下，为驾驶检定提供+1的加成" },
            { name: "1930年凯迪拉克V16型轿车", price: "$5,400", note: "速度（英里时速/公里时速）：90/145。" },
            { name: "1937年捷豹SS100型跑车", price: "$9,500", note: "速度（英里时速/公里时速）：100/161。" },
            { name: "1932年梅巴赫DS8型“齐柏林”", price: "$16,000", note: "速度（英里时速/公里时速）：105/169。" },
            { name: "1938年梅赛德斯-奔驰“格罗瑟”770型巡游车", price: "$20,000", note: "速度（英里时速/公里时速）：80/129。常见的型号为防弹豪华轿车（对子弹有+4的防护加成，最大速度60英里）" },
            { name: "1932年杜森堡SJ轿跑车", price: "$25,000", note: "速度（英里时速/公里时速）：130/209。双座" },
            { name: "1935年劳斯莱斯“幻影”III型豪华轿车", price: "$50,000", note: "速度（英里时速/公里时速）：90/145。八座" }
        ]
    },
    {
        category: "飞行器",
        items: [
            { name: "1917年柯蒂斯JN-4型“珍妮”", price: "$2,000", note: "航程（英里/公里）：250/402；速度（英里时速/公里时速）：75/121。航空表演中常用的双翼机型；双座；单引擎" },
            { name: "1924年道尼尔Do-J“鲸”式水上飞机", price: "$14,000", note: "航程（英里/公里）：2250/3621；速度（英里时速/公里时速）：110/177。可搭载2至4名机组人员与10名乘客" },
            { name: "1933年德·哈维兰DH.89“速龙”式", price: "$20,000", note: "航程（英里/公里）：550/885；速度（英里时速/公里时速）：150/241。可搭载1名机组人员与8名乘客" },
            { name: "1934年塞尔瓦C.30A型旋翼机", price: "$20,000", note: "航程（英里/公里）：285/458；速度（英里时速/公里时速）：110/177。单座；可近乎垂直降落；仅需短跑道即可起飞" },
            { name: "1929年洛克希德“维嘉”5型", price: "$30,000", note: "航程（英里/公里）：675/1086；速度（英里时速/公里时速）：185/297。六座；任何空中的导航能力检定均有+1的加成；单引擎" },
            { name: "1933年波音247", price: "$44,000", note: "航程（英里/公里）：745/1199；速度（英里时速/公里时速）：200/322。搭载3名机组人员与10名乘客" },
            { name: "1935年道格拉斯DC-3型运输机", price: "$47,000", note: "航程（英里/公里）：1500/2414；速度（英里时速/公里时速）：150/241。三座；货舱可搭载20人；每一个场景可恢复1点导航能力点数" },
            { name: "1934年西科斯基S-42型飞行艇", price: "$50,000", note: "航程（英里/公里）：1950/3138；速度（英里时速/公里时速）：180/290。可搭载4名机组人员与37名乘客" },
            { name: "1938年超级马林“喷火”式战斗机", price: "$160,000", note: "航程（英里/公里）：1150/1851；速度（英里时速/公里时速）：380/611。不对外出售；单座战斗机；2门机关炮，4挺机枪" },
            { name: "1928年“齐柏林伯爵”号飞艇", price: "$3,000,000以上", note: "航程（英里/公里）：10000/16093；速度（英里时速/公里时速）：75/121。不对外出售；可搭载36名机组人员与24名乘客" }
        ]
    }
];
